// Запитай у користувача його вік і визначи, ким він є: дитиною (0-11), підлітком (12-17), дорослим (18_59) або пенсіонером (60 ...),
// передбач можливість введення невірних даних.

const button = document.querySelector("button");
const input = document.querySelector(".age");

button.onclick = function () {
    
    let age = input.value;

    if (age >= 0 && age <= 11) {
        alert("Ти є дитина");
        
    } else if (age >= 11 && age <= 17) {
        alert("Ти є підлітком");

    } else if (age >= 18 && age <= 59) {
        alert("Ти є дорослим");

    } else if (age >= 60 && age <= 100) {
        alert("Старий")
    } else {
        alert("Вік вказано некоректно!")
    }
}

//Зацикли відображення днів тижня таким чином: 
//«День тижня. Хочеш побачити наступний день? » і так до тих пір, поки користувач натискає OK.

const daysOfWeek = ['Понеділок', 'Вівторок', 'Середа', 'Четвер', 'П`ятниця', 'Субота', 'Неділя'];

let currentDayIndex = 0;

while (true) {
  const answer = confirm(`${daysOfWeek[currentDayIndex]}. Хочеш побачити наступний день?`);
  if (!answer) {
    break;
  }
  currentDayIndex = (currentDayIndex + 1) % daysOfWeek.length;
}

// Гра «Вгадай число». Запропонуй користувачеві загадати число від 0 до 100 і відгадай його наступним способом: 
//кожну ітерацію циклу діли діапазон чисел навпіл, записуй результат в N і питай у користувача «Ваше число> N, <N або == N?». 
//Залежно від того що вказав користувач, зменшуй діапазон. Початковий діапазон від 0 до 100, поділи навпіл і отримай 50. 
//Якщо користувач вказав, що його число> 50, то зміни діапазон на від 50 до 100. 
//І так до тих пір, поки користувач не вибере == N (буде корисним почитати про алгоритм: "бінарний пошук").

let min = 0;
let max = 100;
let guess;
let answer;

while (answer !== "==") {
  guess = Math.floor((max + min) / 2);
  answer = prompt(`Загадай число!? > ${guess}, < ${guess}, або == ${guess}?`);
  
  if (answer == ">") { 
    min = guess + 1;
  } else if (answer == "<") {
    max = guess - 1;
  }
}

alert(`Я вгадав ваше число - ${guess}!`);

